Repository: huixiangyang/arc-kit
Catalog: Sources/Application/Resources/Localization/WindowSettings.xcstrings
Source language: en
Languages: zh_hans

# connection.unavailable
source: Window Agent temporarily unavailable
zh_hans: 窗口 Agent 暂时不可用

# connection.unavailableReason
source: Window Agent temporarily unavailable: %1$@
zh_hans: 窗口 Agent 暂时不可用：%1$@

# connection.window.action.s.session.ended
source: The window action's session has ended
zh_hans: 窗口操作所属会话已结束

# connection.window.management.off
source: Window management is off
zh_hans: 窗口管理已关闭

# connection.window.service.notReady.reopen.menu
source: Window service not ready. Reopen the menu.
zh_hans: 窗口服务未就绪，请重新打开菜单

# layout.fullScreen
source: Full Screen
zh_hans: 全屏

# layout.fullScreen.display
source: Full-screen display
zh_hans: 全屏显示

# layout.left.third
source: Left Third
zh_hans: 左 1/3

# layout.left.two.thirds
source: Left Two Thirds
zh_hans: 左 2/3

# layout.maximize
source: Maximize
zh_hans: 铺满

# layout.middle.third
source: Middle Third
zh_hans: 中 1/3

# layout.next.display
source: Next Display
zh_hans: 下一屏幕

# layout.previous.display
source: Previous Display
zh_hans: 上一屏幕

# layout.right.third
source: Right Third
zh_hans: 右 1/3

# layout.right.two.thirds
source: Right Two Thirds
zh_hans: 右 2/3

# layout.stageManager
source: Stage Manager
zh_hans: 台前调度

# page.actionIncomplete
source: The last window action did not complete
zh_hans: 上次窗口操作未完成

# page.adjust.window.spacing
source: Adjust window spacing
zh_hans: 调整窗口间距

# page.apps.displays
source: Apps & Displays
zh_hans: 应用与屏幕

# page.drag.screen.edges.resize.windows
source: Drag to screen edges to resize windows
zh_hans: 拖到屏幕边缘调整窗口

# page.enable.window.management
source: Enable Window Management
zh_hans: 启用窗口管理

# page.retry.regular.window
source: Try again with a regular window.
zh_hans: 请换一个普通窗口后重试。

# page.shortcuts
source: Shortcuts
zh_hans: 快捷键

# page.show.target.position.preview
source: Show target position preview
zh_hans: 显示目标位置预览

# page.snapping
source: Drag Snapping
zh_hans: 拖拽吸附

# page.toggle.snapping
source: Toggle drag snapping
zh_hans: 切换拖拽吸附

# page.toggle.snapping.preview
source: Toggle snapping preview
zh_hans: 切换吸附预览

# page.window.management
source: Window management: %1$@
zh_hans: 窗口管理：%1$@

# page.window.settings
source: Window Settings
zh_hans: 窗口设置

# page.window.spacing
source: Window spacing
zh_hans: 窗口间距

# recorder.click.record
source: Click to Record
zh_hans: 点击录制

# recorder.disabled
source: Not enabled
zh_hans: 未启用

# recorder.press.shortcut
source: Press a shortcut…
zh_hans: 按下快捷键…

# recorder.requires
source: Requires ⌘ / ⌃ / ⌥
zh_hans: 需要 ⌘ / ⌃ / ⌥

# recorder.unsupported.key
source: Unsupported key
zh_hans: 不支持此按键

# rules.already.excluded.existing.entry
source: “%1$@” is already excluded. The existing entry is unchanged.
zh_hans: “%1$@”已经在排除列表中；原项目保持不变。

# rules.app.exceptions.multiple.displays
source: App Exceptions and Multiple Displays
zh_hans: 应用例外与多显示器

# rules.change.display.switching.order
source: Change display switching order
zh_hans: 切换多显示器顺序

# rules.display.switching
source: Display switching
zh_hans: 多显示器切换

# rules.exclude.window.management
source: Exclude %1$@ from window management
zh_hans: 排除 %1$@ 的窗口管理

# rules.excluded
source: %1$@ excluded
zh_hans: %1$@ 已排除

# rules.excluded.apps
source: Excluded Apps
zh_hans: 排除 App

# rules.excluded.apps.missing
source: No excluded apps
zh_hans: 暂无排除项

# rules.external.app.available.add.switch.missing
source: No external app available to add. Switch to the app you want to exclude, then return to Arc Kit and click Add.
zh_hans: 没有可添加的外部 App。请先切换到要排除的 App，再回到 Arc Kit 点击添加。

# rules.remove.excluded.window.app
source: Remove excluded window app
zh_hans: 移除窗口排除 App

# shortcuts.change.window.shortcut
source: Change window shortcut
zh_hans: 修改窗口快捷键

# shortcuts.duplicate
source: Duplicate
zh_hans: 重复

# shortcuts.duplicate.shortcuts
source: Duplicate shortcuts:
zh_hans: 以下快捷键重复：

# shortcuts.enable.shortcut
source: Enable shortcut for %1$@
zh_hans: 启用%1$@快捷键

# shortcuts.enable.shortcuts
source: Enable global shortcuts
zh_hans: 启用全局快捷键

# shortcuts.enable.shortcuts.enabling.recording
source: Enable global shortcuts before enabling or recording individual shortcuts.
zh_hans: 开启全局快捷键后，才能启用或录制各项快捷键。

# shortcuts.failedCount
source: %lld global shortcuts failed to register
zh_hans: %lld 个全局快捷键注册失败

# shortcuts.handlerFailed
source: Could not install event handler
zh_hans: 事件处理器安装失败

# shortcuts.menuBar.actions.snapping.remain
source: Menu bar actions and drag snapping remain available when off
zh_hans: 关闭后仍可使用菜单栏和拖拽吸附

# shortcuts.primary.modifier.missing
source: Primary modifier missing
zh_hans: 缺少主修饰键

# shortcuts.registered.failed
source: Registered: %1$@ · Failed: %2$@
zh_hans: %1$@ 个成功，%2$@ 个异常

# shortcuts.registeredCount
source: %lld shortcuts registered
zh_hans: %lld 个已注册

# shortcuts.registration.status
source: Registration status
zh_hans: 注册状态

# shortcuts.reserved.system
source: Reserved by system
zh_hans: 系统占用

# shortcuts.restore.default.shortcuts
source: Restore Default Shortcuts
zh_hans: 恢复默认快捷键

# shortcuts.restore.default.window.shortcuts
source: Restore default window shortcuts?
zh_hans: 恢复默认窗口快捷键？

# shortcuts.restore.window.shortcuts
source: Restore window shortcuts
zh_hans: 恢复窗口快捷键

# shortcuts.restoreHint
source: Replaces custom shortcuts with Magnet-style defaults. Other window settings are unchanged.
zh_hans: 当前自定义快捷键会被 Magnet 风格默认组合替换。其他窗口设置不受影响。

# shortcuts.runtime.error
source: Runtime error
zh_hans: 运行时异常

# shortcuts.shortcuts.need.primary.modifier
source: These shortcuts need a primary modifier:
zh_hans: 以下快捷键缺少主修饰键：

# shortcuts.toggle.shortcuts
source: Toggle global shortcuts
zh_hans: 切换全局快捷键

# shortcuts.unregistered
source: Not registered
zh_hans: 未注册

# shortcuts.unregistered.shortcuts
source: Unregistered shortcuts:
zh_hans: 以下快捷键未注册：

# smokeTest.accessibility
source: - Accessibility permission: %1$@
zh_hans: - 辅助功能权限：%1$@

# smokeTest.accessibility.interface
source: - Accessibility interface: %1$@
zh_hans: - 辅助功能接口：%1$@

# smokeTest.actionNotRecorded
source: Resident Runtime Host did not record a complete successful shortcut chain, pid=%1$@, action=%2$@
zh_hans: 常驻 Runtime Host 未记录完整快捷键成功链路 pid=%1$@ action=%2$@

# smokeTest.actions
source: ## Actions
zh_hans: ## 动作

# smokeTest.activationFailed
source: Cannot activate isolated TextEdit as the shortcut target, expectedPID=%1$@
zh_hans: 无法激活隔离 TextEdit 作为快捷键目标 expectedPID=%1$@

# smokeTest.arcKit.host.smoke.test.failed
source: Arc Kit Runtime Host smoke test failed: %1$@
zh_hans: Arc Kit Runtime Host 烟测失败：%1$@

# smokeTest.arcKit.host.smoke.test.passed
source: Arc Kit Runtime Host smoke test passed: %1$@ actions, %2$@ live entry points
zh_hans: Arc Kit Runtime Host 烟测通过：%1$@ 个动作，%2$@ 条真实入口

# smokeTest.arcKit.window.management.live.smoke.test
source: Arc Kit Window Management Live Smoke Test
zh_hans: Arc Kit 窗口管理真实烟测

# smokeTest.arcKit.window.management.smoke.test.report
source: # Arc Kit Window Management Smoke Test Report
zh_hans: # Arc Kit 窗口管理烟测报告

# smokeTest.arcKit.window.smoke.test.skipped
source: Arc Kit window smoke test skipped: %1$@
zh_hans: Arc Kit 窗口烟测未执行：%1$@

# smokeTest.arcKit.window.smoke.test.skipped.runtime
source: Arc Kit window smoke test skipped: Runtime Host lacks Accessibility permission or the AX interface is unavailable.
zh_hans: Arc Kit 窗口烟测未执行：Runtime Host 辅助功能未授权或 AX 接口不可用。

# smokeTest.available
source: Available
zh_hans: 可用

# smokeTest.desktop.locked.unlock.mac
source: The desktop is locked. Unlock your Mac before running the live window smoke test.
zh_hans: 当前桌面已锁定，无法创建并验证真实窗口；请解锁 Mac 后重新运行烟测

# smokeTest.desktop.state
source: - Desktop state: %1$@
zh_hans: - 桌面状态：%1$@

# smokeTest.display.count
source: - Display count: %1$@
zh_hans: - 显示器数量：%1$@

# smokeTest.enable.window.management.main.app
source: Enable window management in the main app first. Smoke tests do not override committed configuration.
zh_hans: 请先在主应用开启窗口管理；烟测不再绕过已提交配置改变后台状态

# smokeTest.fullScreenEnterFailed
source: Runtime Host did not enter AXFullScreen
zh_hans: Runtime Host 未进入 AXFullScreen

# smokeTest.fullScreenExitFailed
source: Runtime Host did not exit AXFullScreen
zh_hans: Runtime Host 未退出 AXFullScreen

# smokeTest.host.lacks.accessibility
source: Runtime Host lacks Accessibility permission or the AX interface is unavailable
zh_hans: Runtime Host 辅助功能未授权或 AX 接口不可用

# smokeTest.host.request.failed
source: Runtime Host request failed: %1$@
zh_hans: Runtime Host 请求失败：%1$@

# smokeTest.host.returned.action.result.missing
source: Runtime Host returned no action result: %1$@
zh_hans: Runtime Host 未返回动作结果：%1$@

# smokeTest.host.returned.runtime.state.missing
source: Runtime Host returned no runtime state
zh_hans: Runtime Host 未返回运行态

# smokeTest.host.shortcut.action.failed
source: Runtime Host shortcut action failed: %1$@
zh_hans: Runtime Host 快捷键动作失败：%1$@

# smokeTest.hostLaunchFailed
source: Could not start Arc Kit Runtime Host smoke test: %1$@
zh_hans: Arc Kit Runtime Host 烟测启动失败：%1$@

# smokeTest.keyEventFailed
source: Cannot create keyboard event, keyCode=%1$@
zh_hans: 无法创建键盘事件 keyCode=%1$@

# smokeTest.live.entry.points
source: ## Live Entry Points
zh_hans: ## 真实入口

# smokeTest.locked
source: Locked
zh_hans: 已锁定

# smokeTest.notRun
source: - Not run
zh_hans: - 未执行

# smokeTest.processMissing
source: NSWorkspace returned no isolated TextEdit process
zh_hans: NSWorkspace 未返回隔离 TextEdit 进程

# smokeTest.resident.host.shortcut.failed
source: Resident Runtime Host shortcut failed: %1$@
zh_hans: 常驻 Runtime Host 快捷键执行失败：%1$@

# smokeTest.resident.host.shortcuts.notReady.pid
source: Resident Runtime Host shortcuts not ready, pid=%1$@
zh_hans: 常驻 Runtime Host 快捷键未就绪 pid=%1$@

# smokeTest.response.host.missing
source: No response from Runtime Host: %1$@
zh_hans: Runtime Host 未返回响应：%1$@

# smokeTest.shortcutDidNotConverge
source: Runtime Host shortcut result did not converge, pid=%1$@, action=%2$@
zh_hans: Runtime Host 快捷键结果未收敛 pid=%1$@ action=%2$@

# smokeTest.shortcutEventFailed
source: Cannot create a global shortcut event
zh_hans: 无法创建全局快捷键事件

# smokeTest.skipped.actions
source: - Skipped actions: %1$@
zh_hans: - 未执行动作：%1$@

# smokeTest.skipped.missing.accessibility.prerequisites
source: - Skipped: missing Accessibility permission or prerequisites
zh_hans: - 未执行：缺少辅助功能权限或前置条件

# smokeTest.smoke.test.settings.lack.executable.top.left
source: Smoke test settings lack executable top-left or restore shortcuts
zh_hans: 烟测设置缺少可执行的左上角或恢复快捷键

# smokeTest.target.app
source: - Target app: %1$@
zh_hans: - 目标 App：%1$@

# smokeTest.target.pid
source: - Target PID: %1$@
zh_hans: - 目标 PID：%1$@

# smokeTest.textEditLaunchFailed
source: Could not launch an isolated TextEdit smoke test instance: %1$@
zh_hans: 无法启动隔离 TextEdit 窗口烟测实例：%1$@

# smokeTest.textEditMissing
source: TextEdit is missing; cannot create a real external window for the smoke test
zh_hans: 系统缺少 TextEdit，无法创建真实外部窗口烟测目标

# smokeTest.time
source: - Time: %1$@
zh_hans: - 时间：%1$@

# smokeTest.timeout.launching.isolated.textedit.window
source: Timed out launching an isolated TextEdit window
zh_hans: 启动隔离 TextEdit 窗口超时

# smokeTest.timeout.waiting.host
source: Timed out waiting for Runtime Host: %1$@
zh_hans: 等待 Runtime Host 响应超时：%1$@

# smokeTest.unavailable
source: Unavailable
zh_hans: 不可用

# smokeTest.unlocked
source: Unlocked
zh_hans: 已解锁

# snapping.unavailable
source: Drag snapping unavailable
zh_hans: 拖拽吸附不可用

# target.reading.target.window.retry
source: Reading the target window. Try again shortly.
zh_hans: 正在读取目标窗口，请稍后重试

# target.select.target.window.opening
source: Select the target window before opening the panel
zh_hans: 请先选中目标窗口，再打开面板

# scenes.title
source: Scenes
zh_hans: 场景

# scenes.intro
source: Save a group of windows and restore their positions together.
zh_hans: 保存一组窗口的位置，需要时一起恢复。

# scenes.capture
source: Save Current Layout
zh_hans: 保存当前布局

# scenes.needsPermission
source: Enable window management and Accessibility access to capture or arrange windows.
zh_hans: 启用窗口管理并授予辅助功能权限后，才能读取和排列窗口。

# scenes.saveBeforeApply
source: Save the pending settings before applying a scene.
zh_hans: 请先保存待提交的设置，再应用场景。

# scenes.empty
source: Arrange your windows, then save your first scene.
zh_hans: 先摆好工作窗口，再保存第一个场景。

# scenes.scope
source: Scenes manage selected, regular windows on the current desktop. Missing displays are skipped. Full-screen windows, minimized windows, and moving windows between Spaces are not supported.
zh_hans: 场景仅管理当前桌面上选中的普通窗口。未连接的显示器会跳过；暂不支持全屏、最小化窗口及跨桌面空间移动。

# scenes.deleteTitle
source: Delete Scene
zh_hans: 删除场景

# scenes.deleteHint
source: Only the saved layout will be removed. Your windows will stay where they are.
zh_hans: 仅删除保存的布局，当前窗口位置保持不变。

# scenes.counts
source: %1$lld windows · %2$lld displays
zh_hans: %1$lld 个窗口 · %2$lld 个显示器

# scenes.apply
source: Apply
zh_hans: 应用

# scenes.edit
source: Edit Scene
zh_hans: 编辑场景

# scenes.updateLayout
source: Update from Current Layout…
zh_hans: 从当前布局更新…

# scenes.saveAs
source: Save As…
zh_hans: 另存为…

# scenes.copyName
source: %1$@ Copy
zh_hans: %1$@ 副本

# scenes.actions
source: Scene Actions
zh_hans: 场景操作

# scenes.name
source: Scene Name
zh_hans: 场景名称

# scenes.shortcut
source: Shortcut (Optional)
zh_hans: 快捷键（可选）

# scenes.shortcutConflict
source: This shortcut is already used by another scene or window action. Choose a different shortcut.
zh_hans: 此快捷键已用于其他场景或窗口动作，请换一个组合。

# scenes.shortcutsOff
source: Global window shortcuts are off. Enable them in Shortcuts to use this scene shortcut.
zh_hans: 窗口全局快捷键已关闭，请在「快捷键」中启用后使用场景快捷键。

# scenes.commitHint
source: Changes join the pending settings. Save settings to activate them.
zh_hans: 修改将加入待提交设置，保存设置后生效。

# scenes.save
source: Save Scene
zh_hans: 保存场景

# scenes.chooseWindows
source: Choose Windows
zh_hans: 选择窗口

# scenes.chooseHint
source: Choose windows to include. When updating, unchecked identified windows are removed; missing or ambiguous saved windows are preserved.
zh_hans: 选择需要包含的窗口。更新时会移除明确取消勾选的已识别窗口，缺失或有歧义的原窗口仍会保留。

# scenes.refresh
source: Refresh Windows
zh_hans: 刷新窗口

# scenes.noWindows
source: No manageable windows found on the current desktop. Open a regular window and refresh.
zh_hans: 当前桌面没有可管理的窗口，请打开普通窗口后刷新。

# scenes.untitledWindow
source: Untitled Window
zh_hans: 无标题窗口

# scenes.useSelected
source: Use Selected Windows
zh_hans: 使用所选窗口

# scenes.layoutPreview
source: Saved Window Layout
zh_hans: 已保存的窗口布局

# scenes.focus
source: Focus After Applying
zh_hans: 应用后聚焦

# scenes.keepFocus
source: Keep Current Focus
zh_hans: 保留当前焦点

# scenes.reselect
source: Choose Windows and Update Layout…
zh_hans: 重新选择窗口并更新布局…

# scenes.matchRule
source: Window Matching
zh_hans: 窗口匹配规则

# scenes.matchValue
source: Title or Keyword
zh_hans: 标题或关键词

# scenes.matchHint
source: After an app restarts, only a unique match is used. Ambiguous windows require manual rebinding. Editing this rule clears the current window binding.
zh_hans: 应用重启后仅使用唯一匹配的窗口；多个候选需手动重新绑定。修改规则会清除当前窗口绑定。

# scenes.rebind
source: Rebind Window
zh_hans: 重新绑定窗口

# scenes.noMatchingWindows
source: No Windows from This App
zh_hans: 此应用没有可选窗口

# scenes.chooseReplacement
source: Choose Current Window…
zh_hans: 选择当前窗口…

# scenes.displays
source: Displays
zh_hans: 显示器

# scenes.displayHint
source: A missing display is skipped. Remap it explicitly to preserve the layout proportions on another display.
zh_hans: 缺失的显示器会跳过。可明确指定另一显示器，按原布局比例恢复。

# scenes.displayMissing
source: Disconnected
zh_hans: 未连接

# scenes.remapDisplay
source: Map To…
zh_hans: 映射到…

# scenes.rebound
source: Window rebound. The saved position and display are unchanged.
zh_hans: 窗口已重新绑定，保存的位置和显示器保持不变。

# scenes.connectionFailed
source: Window scenes are unavailable. Check window management and Accessibility access, then retry.
zh_hans: 窗口场景暂不可用，请检查窗口管理及辅助功能权限后重试。

# scenes.undoSummary
source: %1$@: undid %2$lld of %3$lld windows
zh_hans: %1$@：已撤销 %2$lld / %3$lld 个窗口

# scenes.applySummary
source: %1$@: restored %2$lld of %3$lld windows
zh_hans: %1$@：已恢复 %2$lld / %3$lld 个窗口

# scenes.lastResult
source: Last Scene Result
zh_hans: 上次场景执行结果

# scenes.undo
source: Undo Layout
zh_hans: 撤销本次布局

# scenes.reviewBindings
source: Review Windows and Displays…
zh_hans: 检查窗口与显示器绑定…

# scenes.undoHint
source: Undo restores only windows moved by this operation that still exist. It does not reopen closed windows.
zh_hans: 撤销仅恢复本次移动且仍然存在的窗口，不会重新打开已关闭的窗口。

# scenes.windowNumber
source: Window %1$lld
zh_hans: 窗口 %1$lld

# scenes.limit
source: You can save up to %1$lld scenes. Remove a scene to add another.
zh_hans: 最多保存 %1$lld 个场景，删除一个后可继续添加。

# scenes.selectionCount
source: Selected %1$lld of up to %2$lld windows
zh_hans: 已选 %1$lld 个窗口，最多 %2$lld 个

# scenes.inventoryExpired
source: The window service restarted. Refresh the window list before selecting or rebinding windows.
zh_hans: 窗口服务已重启，请刷新清单后再选择或绑定窗口。

# scenes.selectionExpired
source: Some selected windows are no longer available. Review the refreshed list and select again.
zh_hans: 部分所选窗口已不可用，请检查刷新后的清单并重新选择。

# scenes.preservedWindows
source: %1$lld saved windows could not be identified and will keep their layouts. You can remove them explicitly in the next step.
zh_hans: %1$lld 个原窗口未能确认，将保留其布局；可在下一步明确删除。

# scenes.saveRejected
source: Settings cannot be edited right now. Your scene is still here; try saving again.
zh_hans: 当前无法修改设置，场景草稿仍然保留，请稍后重新保存。
